{
  "backend/main.mo": "Motoko canister managing user profiles, playlists, favorites, and history with access control and playlist CRUD operations.",
  "feature_evidence.json": "Feature evidence report mapping offline-mode, local-only data, PWA caching, and UI text updates to related frontend files and components.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing many frontend components such as player UI, offline mode hooks, storage, and PWA-related files.",
  "frontend/docs/pulse-player.md": "Documentation outlining Pulse Player’s UI structure, navigation, key screens, and player interactions.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables for light and dark themes along with global styles.",
  "frontend/index.html": "HTML entry point setting up meta tags, PWA manifest, and mounting the app root.",
  "frontend/public/manifest.webmanifest": "PWA manifest describing the app name, theme, start URL, and icons for installability.",
  "frontend/public/sw.js": "Service worker providing offline caching of static assets with versioned cache management and fetch handling.",
  "frontend/src/App.tsx": "Root React component registering the service worker and rendering the themed app shell with player context.",
  "frontend/src/app/layout/AppShell.tsx": "Main application shell managing navigation, offline/offline-only banners, profile setup, and page rendering.",
  "frontend/src/app/offline/offlineOnlyMode.ts": "Manages reading and writing the offline-only mode setting in IndexedDB.",
  "frontend/src/app/offline/useOfflineOnlyMode.ts": "React hook to load and update offline-only mode state with loading status.",
  "frontend/src/app/offline/useOfflineStatus.ts": "React hook tracking browser online/offline status using window events.",
  "frontend/src/components/branding/AppBrandHeader.tsx": "Header component showing themed background, app logo, and title.",
  "frontend/src/components/loading/IndexingSkeleton.tsx": "Skeleton UI showing placeholder rows during media indexing.",
  "frontend/src/components/navigation/BottomNav.tsx": "Bottom navigation bar with tabs for music, video, library, and settings.",
  "frontend/src/features/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth and query reset.",
  "frontend/src/features/auth/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to enter a name unless offline-only.",
  "frontend/src/features/auth/useCurrentUserProfile.ts": "React query hook fetching the current user profile when online and authenticated.",
  "frontend/src/features/equalizer/EqualizerSettingsCard.tsx": "Equalizer settings UI loading and saving preset choice to IndexedDB.",
  "frontend/src/features/equalizer/presets.ts": "Defines EQ presets, gain curves, and human-readable preset labels.",
  "frontend/src/features/favorites/useFavorites.ts": "Manages local favorites and optionally syncs changes to the cloud when online.",
  "frontend/src/features/history/useHistory.ts": "Handles local play history and syncs additions/clears to the cloud when allowed.",
  "frontend/src/features/library/AddLocalMediaButton.tsx": "Button and hidden file input for selecting and adding local media files.",
  "frontend/src/features/library/EmptyLibraryState.tsx": "Empty state view explaining local storage and offering media import.",
  "frontend/src/features/library/LibrarySearchSortBar.tsx": "Search and sort UI for filtering and ordering media tracks.",
  "frontend/src/features/library/LocalMediaNotice.tsx": "Alert explaining that media files are stored locally and work offline.",
  "frontend/src/features/library/searchSort.ts": "Provides search and sort utilities for tracks and videos.",
  "frontend/src/features/library/useLibrary.ts": "Loads media library from IndexedDB, indexes new files, and manages track lists.",
  "frontend/src/features/player/audio/AudioEngine.ts": "Wrapper around HTMLAudioElement providing playback control and event callbacks for time, duration, and state changes.",
  "frontend/src/features/player/FullPlayerSheet.tsx": "Full-screen audio player UI with playback controls, seek bar, volume slider, and track info.",
  "frontend/src/features/player/MiniPlayerBar.tsx": "Compact bottom player bar showing current track with basic play/pause and next controls.",
  "frontend/src/features/player/PlayerProvider.tsx": "React context managing audio playback state, queue logic, repeat/shuffle, and AudioEngine integration.",
  "frontend/src/features/playlists/AddToPlaylistMenu.tsx": "Dropdown menu allowing a track to be added to any existing playlist.",
  "frontend/src/features/playlists/PlaylistDetail.tsx": "Displays a playlist’s tracks with options to play all or delete the playlist.",
  "frontend/src/features/playlists/PlaylistsPanel.tsx": "Panel listing playlists with creation dialog and navigation to playlist detail view.",
  "frontend/src/features/playlists/usePlaylists.ts": "Hook for loading, creating, updating, and syncing playlists locally and optionally to the cloud.",
  "frontend/src/features/recommendations/EmptyRecommendationsState.tsx": "UI placeholder shown when no recommendation activity exists.",
  "frontend/src/features/recommendations/recommendationLogic.ts": "Computes recommendation scores for tracks based on favorites, history, and artist matches, returning the top 10 non-favorite tracks.",
  "frontend/src/features/recommendations/RecommendationsSection.tsx": "Displays recommended tracks or a fallback state when no activity is present.",
  "frontend/src/features/recommendations/useRecommendations.ts": "Hook that combines library, favorites, and history to memoize and expose recommended tracks and activity status.",
  "frontend/src/features/settings/exportData.ts": "Exports all local data and optional cloud data to a downloadable JSON file.",
  "frontend/src/features/settings/PlaybackSettingsCard.tsx": "UI card for toggling video gesture controls using stored player settings.",
  "frontend/src/features/settings/usePlayerSettings.ts": "Hook for loading, updating, and persisting player settings such as gesture controls.",
  "frontend/src/features/sleep-timer/SleepTimerControl.tsx": "Sleep timer UI that lets users set a duration or view and cancel an active timer.",
  "frontend/src/features/sleep-timer/useSleepTimer.ts": "Hook managing a countdown timer that pauses playback when time expires.",
  "frontend/src/features/tracks/TrackActions.tsx": "Renders like/favorite button and playlist menu actions for a track.",
  "frontend/src/features/tracks/TrackList.tsx": "Displays a list of tracks with play controls, metadata, and per-track actions.",
  "frontend/src/features/video/EmptyVideoState.tsx": "Static empty-state component prompting users to add videos.",
  "frontend/src/features/video/VideoPlayerView.tsx": "Full-screen video player with playback, seeking, fullscreen, and control overlay logic.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login, logout, and identity loading logic.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and saving user profiles and exporting cloud data, respecting actor availability and offline-only mode.",
  "frontend/src/index.css": "Tailwind base setup defining light/dark theme CSS variables and utility classes, including safe area helpers and reduced motion rules.",
  "frontend/src/lib/media-utils.ts": "Utility functions for formatting media durations and file sizes into human-readable strings.",
  "frontend/src/lib/media/metadata.ts": "Extracts metadata from media files using filename parsing and duration extraction via Audio/Video elements.",
  "frontend/src/lib/storage/indexedDb.ts": "IndexedDB wrapper defining media-related stores and CRUD helpers for tracks, playlists, favorites, history, and settings.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/LibraryPage.tsx": "Library page showing audio and video collections with search, sort, add-local-media, and indexing states.",
  "frontend/src/pages/MusicPage.tsx": "Music dashboard showing recommendations, playlists, recently played tracks, and favorites.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page handling theme, offline-only mode, login, and exporting local/cloud data.",
  "frontend/src/pages/VideoPage.tsx": "React page that lists video tracks from the library, showing title and size or an empty-state message when none exist.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and sessionStorage parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, spacing, animations, and plugins like typography and container queries.",
  "project_state.json": "Project metadata describing offline-first requirements, existing features, and architectural notes for the Pulse Player app."
}