{
  "backend/main.mo": "Canister implementing user profiles, playlist management, and access-controlled queries and updates using in-memory maps.",
  "feature_evidence.json": "Feature evidence report mapping product features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-generated summaries of various frontend files for documentation and build reference.",
  "frontend/docs/pulse-player.md": "Documentation outlining the app’s UI, navigation, interactions, and major screen behaviors.",
  "frontend/index.css": "Tailwind base layer defining theme variables and styling tokens for light and dark modes.",
  "frontend/index.html": "Base HTML document mounting the React application entrypoint.",
  "frontend/src/App.tsx": "Top-level React component setting up theming, player context, and the app shell.",
  "frontend/src/app/layout/AppShell.tsx": "Main layout handling tab navigation, offline banner, mini player, and page rendering.",
  "frontend/src/app/offline/useOfflineStatus.ts": "Hook tracking browser online/offline state via window event listeners.",
  "frontend/src/components/branding/AppBrandHeader.tsx": "Header with theme-based hero background, logo, and app title.",
  "frontend/src/components/loading/IndexingSkeleton.tsx": "Skeleton loader used while local media files are being indexed.",
  "frontend/src/components/navigation/BottomNav.tsx": "Bottom navigation bar for switching between music, video, library, and settings tabs.",
  "frontend/src/features/auth/LoginButton.tsx": "Button handling Internet Identity login/logout with status-aware UI.",
  "frontend/src/features/auth/ProfileSetupDialog.tsx": "Shows a dialog prompting new authenticated users to enter their name and saves the profile via the backend actor.",
  "frontend/src/features/auth/useCurrentUserProfile.ts": "Fetches the current user's profile from the backend using react‑query, handling actor availability and loading state.",
  "frontend/src/features/equalizer/EqualizerSettingsCard.tsx": "Loads and displays the current EQ preset, allowing users to select and save a preset to IndexedDB.",
  "frontend/src/features/equalizer/presets.ts": "Defines EQ preset types, gain arrays, and user‑visible labels for available equalizer configurations.",
  "frontend/src/features/favorites/useFavorites.ts": "Manages favorite track IDs, syncing between local storage and cloud when possible, and supports toggling favorites.",
  "frontend/src/features/history/useHistory.ts": "Manages recently played history with local storage, syncing with cloud history when authenticated, and supports updates and clearing.",
  "frontend/src/features/library/AddLocalMediaButton.tsx": "Provides a button and hidden file input to import local audio and video files into the library.",
  "frontend/src/features/library/EmptyLibraryState.tsx": "Displays an empty‑state screen for the media library with a notice and button to add local media.",
  "frontend/src/features/library/LibrarySearchSortBar.tsx": "Provides a search bar and sort selector for filtering and ordering library items.",
  "frontend/src/features/library/LocalMediaNotice.tsx": "Shows an alert stating that media is stored locally and works offline.",
  "frontend/src/features/library/searchSort.ts": "Implements search and sorting helpers for tracks and videos by name, size, or date.",
  "frontend/src/features/library/useLibrary.ts": "Loads, indexes, and stores audio and video tracks in IndexedDB, extracting metadata and tracking loading states.",
  "frontend/src/features/player/audio/AudioEngine.ts": "Wraps HTMLAudioElement with callbacks for playback events and provides basic audio control methods.",
  "frontend/src/features/player/FullPlayerSheet.tsx": "Renders the full‑screen player UI with track info, playback controls, seek bar, volume, shuffle, and repeat.",
  "frontend/src/features/player/MiniPlayerBar.tsx": "Shows a compact bottom player bar with track info and basic playback controls, opening the full player on click.",
  "frontend/src/features/player/PlayerProvider.tsx": "Provides global audio player state and controls using AudioEngine, managing queue, playback, and repeat/shuffle modes.",
  "frontend/src/features/playlists/AddToPlaylistMenu.tsx": "Renders a dropdown list of playlists allowing a track to be added to one.",
  "frontend/src/features/playlists/PlaylistDetail.tsx": "Displays a playlist’s tracks with play-all and delete options.",
  "frontend/src/features/playlists/PlaylistsPanel.tsx": "Shows all playlists, supports playlist creation, and links into playlist details.",
  "frontend/src/features/playlists/usePlaylists.ts": "Manages playlist CRUD with local IndexedDB storage and optional cloud sync.",
  "frontend/src/features/recommendations/EmptyRecommendationsState.tsx": "UI component shown when no recommendation activity exists.",
  "frontend/src/features/recommendations/recommendationLogic.ts": "Generates recommendations by scoring tracks using favorites and listen history.",
  "frontend/src/features/recommendations/RecommendationsSection.tsx": "Displays recommended tracks or fallback empty state based on user activity.",
  "frontend/src/features/recommendations/useRecommendations.ts": "Computes recommendations from library, favorites, and history with memoization.",
  "frontend/src/features/settings/PlaybackSettingsCard.tsx": "Renders playback settings UI, currently enabling gesture controls.",
  "frontend/src/features/settings/usePlayerSettings.ts": "Loads and saves player settings such as gesture controls to IndexedDB.",
  "frontend/src/features/sleep-timer/SleepTimerControl.tsx": "Provides UI to start or cancel a sleep timer with preset durations.",
  "frontend/src/features/sleep-timer/useSleepTimer.ts": "Implements a sleep timer hook that counts down and pauses playback when time expires.",
  "frontend/src/features/tracks/TrackActions.tsx": "Renders per-track action buttons including favorite toggling and add-to-playlist menu.",
  "frontend/src/features/tracks/TrackList.tsx": "Displays a list of tracks with play controls, metadata, and action buttons.",
  "frontend/src/features/video/EmptyVideoState.tsx": "Shows an empty-state screen prompting users to add videos.",
  "frontend/src/features/video/VideoPlayerView.tsx": "Provides a fullscreen video player with play controls, seeking, and UI overlays.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication and state.",
  "frontend/src/hooks/useQueries.ts": "Defines hooks to load and save the caller's user profile using the backend actor.",
  "frontend/src/index.css": "Defines global Tailwind layers, theme variables, dark mode, and utility classes.",
  "frontend/src/lib/media-utils.ts": "Utility functions for formatting durations and file sizes.",
  "frontend/src/lib/media/metadata.ts": "Extracts basic media metadata from files, including inferred titles and durations.",
  "frontend/src/lib/storage/indexedDb.ts": "Sets up IndexedDB stores and provides CRUD functions for tracks, playlists, favorites, history, and settings.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/LibraryPage.tsx": "Displays the media library with search, sort, and tabs for audio and video tracks.",
  "frontend/src/pages/MusicPage.tsx": "Shows recommendations, playlists, and tabs for recently played and favorite audio tracks.",
  "frontend/src/pages/SettingsPage.tsx": "Provides account, theme, equalizer, playback, and sleep‑timer settings UI.",
  "frontend/src/pages/VideoPage.tsx": "Lists local video files and allows selecting and viewing a video in a player.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session‑based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing a cross‑platform media player app, its architecture notes, required images, and a list of existing features."
}