{
  "kind": "build_request",
  "title": "Make Pulse Player fully offline and independent (no required network dependencies)",
  "projectName": "Pulse Player",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add an app-wide \"Offline-only\" mode that ensures no Internet Computer canister calls, no Internet Identity login flow, and no cloud-sync/export attempts occur when the mode is enabled.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "make the app fully offline and independent"
        ]
      },
      "acceptanceCriteria": [
        "A persisted user setting (e.g., local storage or IndexedDB) enables/disables Offline-only mode.",
        "When Offline-only mode is ON, the UI does not render or trigger any Internet Identity sign-in/out UI or flows.",
        "When Offline-only mode is ON, the app does not attempt any backend actor calls (including anonymous actor calls) for profiles, playlists, favorites, history, or export.",
        "When Offline-only mode is OFF, existing online behavior remains available (login and optional cloud interactions can still function)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update all data features that currently do optional cloud sync (favorites, history, playlists, profile setup, and settings export) to strictly operate on local IndexedDB data while Offline-only mode is enabled, without showing cloud-related warnings/toasts.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "make the app fully offline and independent"
        ]
      },
      "acceptanceCriteria": [
        "Favorites, history, and playlists load/update entirely from local IndexedDB while Offline-only mode is ON.",
        "Profile setup dialog does not appear in Offline-only mode (or is replaced with a local-only equivalent that does not call the backend).",
        "Settings > Export exports local data only in Offline-only mode and does not attempt to fetch cloud data.",
        "No cloud-sync error/warning toasts are shown in Offline-only mode due to intentionally skipped network calls."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make the application load and remain usable with the browser fully offline by adding offline asset caching (PWA/service worker) for the built frontend assets (HTML/CSS/JS/fonts/icons) so the app shell loads without any network connectivity.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "make the app fully offline and independent"
        ]
      },
      "acceptanceCriteria": [
        "After first load, the app can be reopened with the browser in offline mode and still loads the UI successfully.",
        "Static frontend assets required to render the app are cached for offline use.",
        "The offline cache update behavior is safe (new deploy updates cache on next online session) and does not brick the app."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Revise user-facing copy related to connectivity so it matches the new offline-first behavior (e.g., the offline banner and Settings descriptions) and is consistent with Offline-only mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "make the app fully offline and independent"
        ]
      },
      "acceptanceCriteria": [
        "All user-facing text is English.",
        "When Offline-only mode is ON, the app communicates that it is running locally and does not imply cloud features are expected to work.",
        "When Offline-only mode is OFF but the browser is offline, connectivity messaging clearly indicates which features are unavailable."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Establish and apply a single coherent visual theme refresh for the offline-first product (colors, typography, spacing, component styling) and apply it consistently across the main pages (Music, Video, Library, Settings) without adding new product features.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "make the app fully offline and independent"
        ]
      },
      "acceptanceCriteria": [
        "The UI uses one consistent, intentionally designed theme across pages and key components (navigation, headers, cards, dialogs).",
        "The chosen palette avoids defaulting to a blue/purple theme unless already present in the current design tokens.",
        "No new functional features are introduced as part of the theme refresh."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn components must be composed, not modified).",
    "Do not edit immutable hook/provider paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend must remain a single Motoko actor (all logic in backend/main.mo)."
  ],
  "nonGoals": [
    "Implementing third-party authentication providers (only Internet Identity exists, and must be optional / not required).",
    "Adding external databases or external cloud storage.",
    "Adding real-time sync or WebSocket-based features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [
      "Make Pulse Player fully offline and independent with no required network dependencies."
    ],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for user-facing text."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}