{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Pulse Player offline-only mode, offline-first data, PWA caching, copy updates, and theme refresh",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Introduce a persisted Offline-only mode that disables all canister calls and Internet Identity flows while enabled, without breaking existing online behavior when disabled.",
      "acceptanceCriteria": [
        "A persisted user setting (e.g., local storage or IndexedDB) enables/disables Offline-only mode.",
        "When Offline-only mode is ON, the UI does not render or trigger any Internet Identity sign-in/out UI or flows.",
        "When Offline-only mode is ON, the app does not attempt any backend actor calls (including anonymous actor calls) for profiles, playlists, favorites, history, or export.",
        "When Offline-only mode is OFF, existing online behavior remains available (login and optional cloud interactions can still function)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/app/offline/offlineOnlyMode.ts",
          "operation": "create",
          "description": "Create a small offline-only mode module that persists the setting (using the existing IndexedDB settings store) and exposes helpers to read/update the mode."
        },
        {
          "path": "frontend/src/app/offline/useOfflineOnlyMode.ts",
          "operation": "create",
          "description": "Create a React hook (and optional context/provider) for Offline-only mode that loads the persisted setting on app start and provides a setter for UI."
        },
        {
          "path": "frontend/src/app/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Wire Offline-only mode into the top-level shell: when enabled, do not render ProfileSetupDialog and adjust any app-wide logic that could trigger online flows."
        },
        {
          "path": "frontend/src/pages/SettingsPage.tsx",
          "operation": "modify",
          "description": "Add an app-wide Offline-only toggle UI in Settings and conditionally hide/disable the Account section (including LoginButton rendering) when Offline-only mode is enabled."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure favorites, history, playlists, profile setup, and export use only local IndexedDB while Offline-only mode is enabled, with no cloud-sync warnings/toasts.",
      "acceptanceCriteria": [
        "Favorites, history, and playlists load/update entirely from local IndexedDB while Offline-only mode is ON.",
        "Profile setup dialog does not appear in Offline-only mode (or is replaced with a local-only equivalent that does not call the backend).",
        "Settings > Export exports local data only in Offline-only mode and does not attempt to fetch cloud data.",
        "No cloud-sync error/warning toasts are shown in Offline-only mode due to intentionally skipped network calls."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/favorites/useFavorites.ts",
          "operation": "modify",
          "description": "Gate all cloud sync behavior behind Offline-only mode so that when enabled the hook only reads/writes favorites from IndexedDB and never calls the backend actor."
        },
        {
          "path": "frontend/src/features/history/useHistory.ts",
          "operation": "modify",
          "description": "Gate all cloud sync behavior behind Offline-only mode so that when enabled the hook only reads/writes history from IndexedDB and never calls the backend actor."
        },
        {
          "path": "frontend/src/features/playlists/usePlaylists.ts",
          "operation": "modify",
          "description": "Gate all cloud sync behavior behind Offline-only mode so that when enabled playlist operations are strictly local (IndexedDB) and never call the backend actor."
        },
        {
          "path": "frontend/src/features/auth/ProfileSetupDialog.tsx",
          "operation": "modify",
          "description": "Prevent the profile setup dialog from appearing in Offline-only mode to ensure there are no backend calls for profile creation while offline-only."
        },
        {
          "path": "frontend/src/features/auth/useCurrentUserProfile.ts",
          "operation": "modify",
          "description": "Disable the profile react-query fetch while Offline-only mode is enabled so the app never attempts to call getCallerUserProfile in offline-only."
        },
        {
          "path": "frontend/src/pages/SettingsPage.tsx",
          "operation": "modify",
          "description": "Update export behavior so that in Offline-only mode it exports local data only, does not attempt cloud export calls, and does not show cloud-unavailable warnings/toasts."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure cloud export query helpers cannot be triggered while Offline-only mode is enabled (e.g., require offline-only to be false before any cloud export fetch logic runs)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add offline asset caching via a service worker (PWA) so the app shell and built assets load when the browser is fully offline after first load.",
      "acceptanceCriteria": [
        "After first load, the app can be reopened with the browser in offline mode and still loads the UI successfully.",
        "Static frontend assets required to render the app are cached for offline use.",
        "The offline cache update behavior is safe (new deploy updates cache on next online session) and does not brick the app."
      ],
      "file_operations": [
        {
          "path": "frontend/public/sw.js",
          "operation": "create",
          "description": "Add a service worker that caches same-origin GET requests for the app shell and static assets (JS/CSS/fonts/icons) with safe versioned cache cleanup and an update strategy that refreshes on next online session."
        },
        {
          "path": "frontend/public/manifest.webmanifest",
          "operation": "create",
          "description": "Add a minimal web app manifest to support installability and offline-first behavior (name, start_url, display, theme_color/background_color, icons)."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Wire the web manifest and add recommended PWA meta tags so the app is PWA-ready for offline usage."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register the service worker from within the React app (without modifying frontend/src/main.tsx) and provide a safe update flow (e.g., register on load and allow the new worker to activate on next session)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update connectivity-related UI copy to match offline-first behavior and Offline-only mode states.",
      "acceptanceCriteria": [
        "All user-facing text is English.",
        "When Offline-only mode is ON, the app communicates that it is running locally and does not imply cloud features are expected to work.",
        "When Offline-only mode is OFF but the browser is offline, connectivity messaging clearly indicates which features are unavailable."
      ],
      "file_operations": [
        {
          "path": "frontend/src/app/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Revise the offline banner copy to distinguish between (a) Offline-only mode enabled (local-only messaging) and (b) browser offline while Offline-only mode is disabled (cloud/auth features unavailable messaging)."
        },
        {
          "path": "frontend/src/pages/SettingsPage.tsx",
          "operation": "modify",
          "description": "Revise Settings copy (Account section + Export description + Offline-only toggle help text) to be consistent with offline-first behavior and not imply cloud features are expected in Offline-only mode."
        },
        {
          "path": "frontend/docs/pulse-player.md",
          "operation": "modify",
          "description": "Update documentation text describing connectivity/cloud behavior to reflect the new Offline-only mode and offline-first UX."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Apply a coherent visual theme refresh (colors/typography/spacing/component styling) consistently across Music, Video, Library, and Settings without adding features.",
      "acceptanceCriteria": [
        "The UI uses one consistent, intentionally designed theme across pages and key components (navigation, headers, cards, dialogs).",
        "The chosen palette avoids defaulting to a blue/purple theme unless already present in the current design tokens.",
        "No new functional features are introduced as part of the theme refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Refresh global theme tokens (CSS variables used by Tailwind/shadcn styles) for an offline-first aesthetic (colors/typography/spacing), avoiding a default blue/purple palette while keeping light/dark parity."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Adjust/extend Tailwind theme configuration as needed to support the refreshed design tokens and consistent spacing/typography across the app."
        },
        {
          "path": "frontend/src/components/branding/AppBrandHeader.tsx",
          "operation": "modify",
          "description": "Apply the refreshed theme styling to the hero/header (typography, overlays, spacing) while continuing to use the existing generated assets at frontend/public/assets/generated/hero-bg-dark.dim_1440x900.png, frontend/public/assets/generated/hero-bg-light.dim_1440x900.png, and frontend/public/assets/generated/app-logo.dim_512x512.png."
        },
        {
          "path": "frontend/src/components/navigation/BottomNav.tsx",
          "operation": "modify",
          "description": "Align the bottom navigation styling with the refreshed theme (colors, elevation/borders, active-state styling, spacing) consistently across all main tabs."
        },
        {
          "path": "frontend/src/pages/MusicPage.tsx",
          "operation": "modify",
          "description": "Apply consistent page-level spacing, section headers, and card/list styling in the Music tab to match the refreshed theme (no new features)."
        },
        {
          "path": "frontend/src/pages/VideoPage.tsx",
          "operation": "modify",
          "description": "Apply consistent page-level spacing and list/card styling in the Video tab to match the refreshed theme (no new features)."
        },
        {
          "path": "frontend/src/pages/LibraryPage.tsx",
          "operation": "modify",
          "description": "Apply consistent page-level spacing, headers, and tabs/list styling in the Library tab to match the refreshed theme (no new features)."
        },
        {
          "path": "frontend/src/pages/SettingsPage.tsx",
          "operation": "modify",
          "description": "Apply consistent card styling, section separators, and typography in Settings to match the refreshed theme, including the Offline-only toggle section (no new features)."
        }
      ]
    }
  ]
}